# BuiltInFailures.GenericFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericFailures Class
BuiltInFailures Class Members See Also
---
Generic failures that may apply to any Revit Element
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class GenericFailures
```

Visual Basic
---
```text
Public NotInheritable Class GenericFailures
```

Visual C++
---
```text
public ref class GenericFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..GenericFailures
# See Also
BuiltInFailures..::..GenericFailures Members
Autodesk.Revit.DB Namespace